const military_list = ['리치웨어시스템즈', '플레이오토', '대윤계기산업', '거봉', '지엘에스이', '원프랜트', '소프트원', '히스코센서', '피알앤디컴퍼니', '엠플러스테크놀러지', '오스테오닉', '에스더전자', '엑세스', '엠케이프리시젼', '씨에스이노베이션', '오토스광학', '나오테크놀로지스', '엠에이피한터인종합건축사사무소', '해창개발', '엔진스튜디오', '지아이웍스', '아이알링크', '슈퍼솔루션', '제이제이툴스', '헥스파워시스템', '기산전자', '삼원금형정공', '뉴데이소프트', '한강기전', '에이티솔루션즈', '(유)아키텍트그룹', '씨즈디자인', '인프라소프트', '디에스글로벌', '큐알온텍', '비전인사이드', '투브플러스', '테스탑', '송우전자', '호디', '아이엠에스나노텍', '이노스파크', '하이퍼커넥트', '비손메디칼', '넥스트플로어', '데브시스터즈', '이큐브랩', '휴레이포지티브', '우아한형제들', '한성컴퓨터', '조은아이앤에스', '아카온', '트러스트어스', '진흥전기', '하닉스', '협성히스코', '다우밸브', '대일정공', '나노바이오시스', '시큐브', '유프리즘', '대화라벨앤택스', '디지털프로그', '맥슨씨아이씨', '세기정보통신', '강우기업', '미림미디어랩', '로우코리아', '헬로월드', '유씨알엠', '모니터랩', '웰게이트', '마이크로디지털', '봄텍전자', '성보하이드로엔지니어링', '도움이티에스', '스카이컴', '아이엠티소프트', '영일교육시스템', '진영지앤티', '삼영기업', '제이엠에스건설', '코이즈', '두루안', '지오스토리', '저니앤조이트래블', '라온시큐어', '아이스파이프', '삼정데이타서비스', '스포카서울지점', '에이블스토어', '기린전자', '지비엠아이엔씨', '로보티즈', '현대인프라코어', '이오에스아이', '케이오비에이', '라이브셀인스트루먼트', '세연테크', '리디', '엘레파츠', '한국퍼버트기연', '더스탠다드', '목스코', '빙글', '엑스엔(XN)시스템즈', '올엠', '피노텍', '아이퀘스트', '제이피케이코리아', '젬코쥬얼리', '에스이웍스', '라디안', '앤서', '아이오시스템', '릴리에스앤씨', '뉴티씨', '돈흥실업', '넥스파시스템', '어썸피스', '이비즈네트웍스', '지테크시스템', '케이에스티테크놀로지', '진코퍼레이션', '스타공구', '준쥬얼리', '디지탈쉽', '비케이에스엔피', '삼지전자', '아진금형', '오스테오시스', '이레텍', '안성공업', '씨디컴', '주어링', '삼화당피앤티', '보미건설', '투윈스컴', '오스퀘어', '메인라인', '전일정공사', '오픈갤러리', '범양이엔씨', '사이버텔브릿지', '에버스핀', '비비드펄', '피에조테크놀리지', '푸드테크', '아이젝스', '포씨소프트', '지이씨일렉트로닉스', '대륭', '보창몰드', '크레이터', '지앤에스기술', '봉봉', '장원조경', '소하테크', '콩스튜디오코리아', '시프트업', '벨로프', '오드원게임즈', '키오스크코리아', '엔투스튜디오', '올로케이션', '우현디지털', '프라이피', '이오비스', '블루홀피닉스', '피플벤처스', '뤼이드', '발란스커리어', '현은텍스타일', '당신의파트너', '원캐스트', '명성인스트루먼트', '선도소프트', '힐링페이퍼', '테라핀테크', '삼일피엔유', '쇼다운', '백패커', '비트파인더코리아', '세넷시스템즈', '그루기술', '토마토전자', '코인원', '유런테크', '어니스트펀드', '합동전자산업', '구름네트웍스', '와탭랩스', '대성텔레콤', '포스트엠비', '스탠다드네트웍스', '셀메이트', '아이코어이앤씨', '아틀라스네트웍스', '라프텔', '이지식스코리아', '데이코어', '크로키닷컴', '리얼리티리플렉션', '우신인포텍', '진승정보기술', '지니웍스', '헬프미', '대연씨앤아이', '우진전장', '유니와이드테크놀러지', '업루트', '에이비일팔공', '여행노트앤투어', '씨엠티정보통신', '하이버스', '에스엘지', '로플랫', '아이아라', '한국제이에스데이터시스템즈', '모프인터랙티브', '링크샵스', '고려전기상사', '한성정보기술', '에이케이티공간정보', '에이스테크닉스', '피어스넷', '정보와기술', '와이지에스콘트롤', '스타텍코리아', '포스윈', '스타일닷컴', '휴먼플러스', '신우에프에이', '유디테크', '마켓잇(Marketit Inc.)', '대한센서', '푸른숲컴퍼니', '서울시스템', '엠앤와이즈', '광명테크솔루션', '위즈콘테크놀로지', '인픽스', '윌비소프트', '어빌리티시스템즈', '파레트코', '디에스앤텍', '비디에스인포컴', '센티널테크놀로지', '아미스테크놀로지', '천명소프트', '삼미정보시스템', '위니웍스', '싸이크로스', '아이엠씨큐브', '콘텐츠브릿지', '스마트동스쿨', '에어포스', '캐리마', '포테닛', '제우스이엔지', '아이백코리아', '대동몰드', '갈라랩', '네시삼십삼분', '샐러드볼크리에이티브', '엔비어스', '이키나게임즈', '소프트닉스', '에이스프로젝트', '베이글코드', '에스디엔터넷', '포트락게임즈', '크레이브몹', '신보', '선산토건', '우원개발', '윤창기공', '우림플랜트', '강성기어제작소', '마빈시스템', '멀티스하이드로', '쓰리알', '에버뷰', '에이치엠디지털기미상궁', '에이치와이티씨', '우성자동문', '이원테크놀러지', '컴파스시스템', '티엠티엔지니어링', '프러스상사', '경인계측시스템', '반석정밀공업', '씨앤엠로보틱스', '유경제어', '유진인스텍', '은성에프에이', '자인테크놀로지', '에코카', '지트랜시스', '포인트닉스', '로보빌더', '스타덴텍코리아', '제이엔티코퍼', '화인쥬얼리', '휘권양행', '렉시아인터내셔널', '성원에프씨', '아이디모드', '나루지퍼', '그래피직스', '카프프러덕션', '레트로봇', '덱스코윈', '수일개발', '유니메딕스', '제일메디칼코퍼레이션', '에이엠피올', '인트로메딕', '현주인테크', '대신엔터프라이즈', '케이티메드', '다래파크텍', '미랑', '비덴트', '미래이앤아이', '장안산업', '지시코', '현대아이티에스전자', '프로보', '리더스텍', '미라클산업', '이오닉스', '제임스텍', '카스모아이티', '파워웰', '파워트로닉스', '유엔콘트롤', '거산전자통신', '기림전자', '로보큐브테크', '성호반도체', '수정전자산업', '자이글', '조아전자', '콕스', '테크닉스', '한양전자산업', '화인엠이씨', '효신전기', '가우미디어', '가이온', '개미집소프트', '공영디비엠', '그레이스제이', '넥솔시스템', '노크노크', '누스랩', '다하미커뮤니케이션즈', '드림와이즈', '라톤테크', '마이크로폴리스', '망고플레이트', '메디칼엑셀런스', '모모콘', '미디어솔루션', '밀레21', '부동산뱅크', '블리엔', '비케이아이티', '소프트가족', '소프트베르크', '스윙크', '써브나라', '써티웨어', '씨퓨처', '아스템즈', '아이엔티매니지먼트', '아이온커뮤니케이션즈', '아이티라인', '알엠소프트', '에스앤비소프트', '에이엔티홀딩스', '에이티앤에스그룹', '에코앤컴퍼니', '에프지아이', '엔소울즈', '엠엘소프트', '엠엠벤처스', '영우씨엔아이', '오픈놀', '와치텍', '위시켓', '위즈디엔에스코리아', '유폴라리스', '이랜서', '이모션글로벌', '이스트소프트', '이스트시큐리티', '이즈파크', '이피피엔', '잉카인터넷', '제이피브라더스', '조이코퍼레이션', '중앙아이씨에스', '케이라운지', '케이원정보통신', '타운컴퍼니', '티라유텍', '티엔씨테크날로지', '파이낸셜데이타시스템', '파티게임즈', '포시에스', '포인트파크', '필라웨어', '핸디커뮤니케이션즈', '휴메카정보통신', '넷스루', '유비스티', '구우정보기술', '네오그라프', '넷다이버', '니벤스컴퍼니', '다다소프트', '대신통신기술', '데이터클립', '두나무', '디비비전', '디앤에스에버', '마크애니', '벌키트리', '블루웨이브컨설팅', '사이버씨브이에스', '상상스토리', '서울이동통신', '소프트온넷', '쉐이커미디어', '슈어엠', '시지온', '식신', '심심이', '쓰리에스플래너', '아이라이즈', '앤서시스템', '에이쓰리', '엔시온', '온오프믹스', '와우커뮤니케이션', '웹케시', '유니원아이앤씨', '유플리트', '이디엄', '젤리코스터', '5민랩', '데브구루', '레이니스트', '아인톱시스템', '애드크레딧', '에이엠아이시스템즈', '직방', '케이제이소프트앤마케팅', '글로벌소프트', '넥스트이온', '노리코리아', '라이클', '렌딧', '리싸이클파크', '모두파트너스', '모비데이즈', '미탭스플러스', '배틀엔터테인먼트', '브이에이트', '스캐터랩', '스타일쉐어', '엑셈', '엠포', '온누리네트', '웰비아닷컴', '이다시스템', '이투엔터테인먼트', '이포넷', '정글엠앤씨', '컬처메이커스', '케어랩스', '콜론디', '팬덤', '플레이팅', '진진시스템', '케이웨어', '코리아엑스퍼트', '코코소프트', '큐티코리아', '파킹클라우드', '팝조이', '퓨렌스', '플라이앤컴퍼니', '하트미디어', '한국아이티컨설팅', '한국자산평가', '후퍼', '융합테크', '태양자동문', '삼영씨티', '경우시스테크', '다림비젼', '루먼텍', '메인테크엔지니어링', '아이머큐리', '아트웨어', '엔티티웍스', '엘트정보기술', '원우이엔지', '유비라인', '정원씨앤에스', '참슬테크', '캐스트윈', '컴아트시스템', '케이티엔에프', '트루엔', '포딕스시스템', '대한신호', '디비시스', '보은전자방송통신', '서울전자통신', '신영전자통신', '일진디자인', '제네시스인터내셔널', '컴트리', '김스애드', '테라텍', '파이오링크', '코위버-당산동지점', '삼원프린테크', '메이비원', '성우애드컴', '세현파크', '승현정밀', '금부치아', '일성전자', '케빅', '대도도금', '이씨오', '세인트시큐리티', '퓨쳐위즈', '위두커뮤니케이션즈', '유라클', '하몬소프트', '한국영상', '서광양행', '키즈노트', '한국금거래소쓰리엠', '성일기공', '센트롤', '에스더블유몰드텍', '대가파우더시스템', '선양몰텍', '비엔에프아이디', '공진기공', '국일메카트로닉스', '코아쥬얼리', '탐라엔씨', '삼환티에프', '로보로보', '영창실리콘', '예성엔지니어링', '경보전기', '제이앤엠디스플레이', '에니텍시스', '엑사이엔씨', '이스텍', '대성하이테크전자', '티에이치센서', '한국로보트', '탑테크이십일', '애드샵컴퍼니', '스냅스', '평화당인쇄', '엠더블유스토리', '비원이즈', '미라지웍스', '프렌트립', '코스코이', '아이지에이웍스', '버킷플레이스', '비바리퍼블리카', '엠아이큐브솔루션', '피플커넥트', '디앤디랩', '와이즈에프엔', '모젯', '엔지스테크널러지', '양재미디어', '버즈니', '토이스미스', '지오소프트', '지케스', '넷사랑컴퓨터', '펜타시큐리티시스템', '엔티시스', '누리미디어', '드라마앤컴퍼니', '마이리얼트립', '씨엔티테크', '무브', '이스트몹', '코비젼', '엔비티', '비투링크', '비오시스템즈', '이음소시어스', '자이닉스', '엘에스웨어', '수도프리미엄엔지니어링', '나고소프트', '케이웨더', '드라이어드', 'VCNC', '온라인투어', '한국비즈넷', '라이프사이언스테크놀로지', '아이디인큐', '비트러스트', '인스웨이브시스템즈', '인포바인', '웹티즌', '제이컴정보', '매그넘빈트', '폴리큐브', '솔트웨어', '지니프릭스', '메타빌드', '매트릭스투비', '도전하는사람들', '컴트루테크놀로지', '오토브레인', '더블유코퍼레이션', '지오피아', '어니언소프트웨어', '코리아컨텐츠네트워크', '한국아이시스', '씨딘', '에스씨에스프로', '티플러스', '케이투이', '케이티앤씨', '제이케이테크', '포소드', '윈어텍', '합동전자통신', '씨엔피테크', '우영정보통신', '아이티로그', '나온아이앤티', '메인테크플랜트', '맥스온소프트', '아이엠씨게임즈', '제페토', '퍼니글루', '재미인터랙티브', '레드덕', '드림익스큐션', '퍼플랩', '슈퍼어썸', '씨씨알', '세시소프트', '팝콘픽쳐스', '씨엔비위즈', '엠그램', '오윈', '시스원', '인피니그루', '페코텍', '밸런스히어로', '슈어소프트테크', '자비스앤빌런즈', '디스트릭트홀딩스', '푸른밤', '비브로스', '인벤티스', '리비', '메이크어스 모바일', '엠시큐어', '윌비솔루션', '인포월드', '브랜디', '해줌', '오픈소스컨설팅', '두양건축', '나인엠인터랙티브', '수아랩', '에프원시큐리티', '에스와이제이', '브러쉬뱅크', '인브레인', '엠게임', '페이민트', '무브게임즈', '메쉬코리아', '펀플웍스', '슈퍼플래닛', '하이컴텍', '스튜디오미르', '넥스트매치'];

const wanted_start_url = '/api/v3/search?tag_type_id=518&langs=%5Bu%27ko%27%2C+u%27en%27%5D&1529591223518';
const rocket_punch = 'https://www.rocketpunch.com/api/jobs/template?job=sw-developer&page=70&q=';

const rp = require('request-promise');
const fs = require('fs');

const wanted_military_list = [];

function check_string_in_list(company_name) {
    for (let i = 0; i < military_list.length; i++) {
        if(company_name.includes(military_list[i])) return true;
    }

    return false;
}

async function get_list_from_wanted() {
    let url = wanted_start_url;
    do {
        const options = {
            uri: 'https://www.wanted.co.kr' + url,
            json: true,
        };

        const data = await rp(options);

        data.data.jobs.data.map((company_data) => {
            if(check_string_in_list(company_data['company_name'])) {
                wanted_military_list.push({
                    company_name: company_data['company_name'],
                    position: company_data['position'],
                    logo_img: company_data['logo_img'],
                    recruit_page: 'wanted',
                    recruit_id: company_data['id'],
                })
            }
        });

        url = data.links.next;
    } while (url != null);

    let file = fs.writeFileSync('WantedList.json', JSON.stringify(wanted_military_list), 'utf8');
}

get_list_from_wanted();